app/Http/Controllers/Admin/EmployeeController.php

    public function index()
    {
        $items = Employee::all();
---
select * from `employees` where `employees`.`deleted_at` is null

    public function edit($id_employee)
    {
        // $item = Employee::findOrFail($id_employee);

        $item = Employee::where('id_employee', '=', $id_employee)->firstOrFail();
---
select * from `employees` where `id_employee` = 'IP06001' and `employees`.`deleted_at` is null limit 1

    public function update(EmployeeRequest $request, $id_employee)
    {
        //PERLU DICEK LAGI
        $data = $request->all();

        $item = Employee::findOrFail($id_employee);

        $item->update($data);
---
update `employees` set `deleted_at` = '2021-09-25 08:19:13', `employees`.`updated_at` = '2021-09-25 08:19:13' where `id_employee` = 'IP2'