app/Http/Controllers/Admin/LeaveController.php

select * from `leaves` where `leaves`.`deleted_at` is null
---
    public function index()
    {
        $items = Leave::with(['employee'])->get();

select * from `employees` where `employees`.`deleted_at` is null
---
    public function create()
    {
        $employees = Employee::all();

update `leaves` set `leave_period` = '2', `leaves`.`updated_at` = '2021-09-25 12:48:40' where `id` = 1
---
    public function update(LeaveRequest $request, $id)
    {
        //PERLU DICEK LAGI
        $data = $request->all();

        $item = Leave::findOrFail($id);

        $item->update($data);